. version 16

. 
. sysuse auto, clear
(1978 Automobile Data)

. 
. gen ln_price = ln(price)

. 
. char rep78[omit] 2

. 
. global ylist ln_price

. 
. global xlist i.foreign  mpg weight i.rep78 

. 
. *global xlist i.sexo edad ib(2).edo_conyug i.DOCniv_ed i.region hli i.tot_integ ib(9).po
&gt; sicion i.sector
. 
. xi: reg $ylist $xlist , vce(robust) baselevels
i.foreign         _Iforeign_0-1       (naturally coded; _Iforeign_0 omitted)
i.rep78           _Irep78_1-5         (naturally coded; _Irep78_2 omitted)

Linear regression                               Number of obs     =         69
                                                F(7, 61)          =      10.64
                                                Prob &gt; F          =     0.0000
                                                R-squared         =     0.5603
                                                Root MSE          =     .27164

------------------------------------------------------------------------------
             |               Robust
    ln_price |      Coef.   Std. Err.      t    P&gt;|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iforeign_1 |   .5108752   .1298752     3.93   0.000     .2511736    .7705767
         mpg |  -.0014682   .0101162    -0.15   0.885    -.0216967    .0187604
      weight |    .000469   .0000984     4.77   0.000     .0002723    .0006657
   _Irep78_1 |  -.0434365   .1357329    -0.32   0.750    -.3148512    .2279781
   _Irep78_3 |   .0424603   .1286047     0.33   0.742    -.2147007    .2996214
   _Irep78_4 |    .062527   .1423333     0.44   0.662    -.2220861    .3471401
   _Irep78_5 |   .1034642   .1627644     0.64   0.527    -.2220033    .4289316
       _cons |   7.043255   .5081997    13.86   0.000     6.027047    8.059463
------------------------------------------------------------------------------

. 
. global xlist2 _Iforeign_1 _Irep78_1 _Irep78_3 _Irep78_4 _Irep78_5 mpg weight

. 
. 
. qreg $ylist $xlist2 , quantile(.1121) vce(robust) baselevels
Iteration  1:  WLS sum of weighted deviations =  5.4474386

Iteration  1: sum of abs. weighted deviations =  25.036073
Iteration  2: sum of abs. weighted deviations =  5.8899536
Iteration  3: sum of abs. weighted deviations =   5.339525
Iteration  4: sum of abs. weighted deviations =  4.5276173
Iteration  5: sum of abs. weighted deviations =  4.1166431
Iteration  6: sum of abs. weighted deviations =   3.624363
Iteration  7: sum of abs. weighted deviations =  3.4509685
Iteration  8: sum of abs. weighted deviations =  2.9401871
Iteration  9: sum of abs. weighted deviations =  2.7041443
Iteration 10: sum of abs. weighted deviations =  2.6892893
Iteration 11: sum of abs. weighted deviations =  2.6247496
Iteration 12: sum of abs. weighted deviations =  2.5989691
Iteration 13: sum of abs. weighted deviations =  2.5884836
Iteration 14: sum of abs. weighted deviations =  2.5088703
Iteration 15: sum of abs. weighted deviations =  2.5088664

.1121 Quantile regression                           Number of obs =         69
  Raw sum of deviations 3.352709 (about 8.2674494)
  Min sum of deviations 2.508866                    Pseudo R2     =     0.2517

------------------------------------------------------------------------------
             |               Robust
    ln_price |      Coef.   Std. Err.      t    P&gt;|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iforeign_1 |   .2824672   .0837367     3.37   0.001     .1150254     .449909
   _Irep78_1 |    .227352   .0616118     3.69   0.000     .1041516    .3505523
   _Irep78_3 |   .0679125   .0708919     0.96   0.342    -.0738446    .2096695
   _Irep78_4 |   .1845588   .0802062     2.30   0.025     .0241766     .344941
   _Irep78_5 |   .2155663   .1189561     1.81   0.075    -.0223011    .4534338
         mpg |  -.0184686   .0075579    -2.44   0.017    -.0335814   -.0033557
      weight |   .0001538   .0000597     2.58   0.012     .0000344    .0002732
       _cons |   8.075313   .3316648    24.35   0.000     7.412108    8.738517
------------------------------------------------------------------------------

. qreg $ylist $xlist2 , quantile(.2562) vce(robust) baselevels
Iteration  1:  WLS sum of weighted deviations =  6.1698334

Iteration  1: sum of abs. weighted deviations =  6.2066856
Iteration  2: sum of abs. weighted deviations =    6.12047
Iteration  3: sum of abs. weighted deviations =     5.4994
Iteration  4: sum of abs. weighted deviations =  5.2645703
Iteration  5: sum of abs. weighted deviations =  5.2026678
Iteration  6: sum of abs. weighted deviations =   4.999929
Iteration  7: sum of abs. weighted deviations =  4.8076576
Iteration  8: sum of abs. weighted deviations =  4.8069298
Iteration  9: sum of abs. weighted deviations =  4.8068465

.2562 Quantile regression                           Number of obs =         69
  Raw sum of deviations 6.558408 (about 8.3397398)
  Min sum of deviations 4.806846                    Pseudo R2     =     0.2671

------------------------------------------------------------------------------
             |               Robust
    ln_price |      Coef.   Std. Err.      t    P&gt;|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iforeign_1 |    .341977   .1115977     3.06   0.003     .1188964    .5650576
   _Irep78_1 |   .0423206          .        .       .            .           .
   _Irep78_3 |    .048169   .1559409     0.31   0.758    -.2635523    .3598904
   _Irep78_4 |   .1061359   .1784922     0.59   0.554    -.2506649    .4629368
   _Irep78_5 |    .136232   .1739479     0.78   0.437    -.2114849     .483949
         mpg |   .0008275    .014491     0.06   0.955    -.0281396    .0297945
      weight |   .0003603   .0001152     3.13   0.003       .00013    .0005906
       _cons |    7.19643   .6357258    11.32   0.000     5.925633    8.467228
------------------------------------------------------------------------------

. qreg $ylist $xlist2 , quantile(.4011) vce(robust) baselevels
Iteration  1:  WLS sum of weighted deviations =  6.6151245

Iteration  1: sum of abs. weighted deviations =  6.7863172
Iteration  2: sum of abs. weighted deviations =  6.7337049
Iteration  3: sum of abs. weighted deviations =  6.3983182
Iteration  4: sum of abs. weighted deviations =  6.2515804
Iteration  5: sum of abs. weighted deviations =  6.2210777
Iteration  6: sum of abs. weighted deviations =   6.174156
Iteration  7: sum of abs. weighted deviations =  6.1738324
Iteration  8: sum of abs. weighted deviations =  6.1685357
Iteration  9: sum of abs. weighted deviations =  6.1683545

.4011 Quantile regression                           Number of obs =         69
  Raw sum of deviations 8.862282 (about 8.4546795)
  Min sum of deviations 6.168354                    Pseudo R2     =     0.3040

------------------------------------------------------------------------------
             |               Robust
    ln_price |      Coef.   Std. Err.      t    P&gt;|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iforeign_1 |   .4930117   .1582999     3.11   0.003     .1764716    .8095519
   _Irep78_1 |  -.1122191   .1377734    -0.81   0.419    -.3877141     .163276
   _Irep78_3 |  -.0371448   .1094091    -0.34   0.735    -.2559219    .1816323
   _Irep78_4 |   .0290209    .153416     0.19   0.851    -.2777534    .3357952
   _Irep78_5 |   .0215818   .2069006     0.10   0.917    -.3921416    .4353052
         mpg |  -.0046212   .0123565    -0.37   0.710    -.0293296    .0200873
      weight |   .0004228   .0000985     4.29   0.000     .0002258    .0006198
       _cons |   7.232151   .5469786    13.22   0.000       6.1384    8.325902
------------------------------------------------------------------------------

. qreg $ylist $xlist2 , quantile(.5232) vce(robust) baselevels
Iteration  1:  WLS sum of weighted deviations =  6.7958447

Iteration  1: sum of abs. weighted deviations =  6.8588166
Iteration  2: sum of abs. weighted deviations =  6.7872914
Iteration  3: sum of abs. weighted deviations =  6.6648395

.5232 Quantile regression                           Number of obs =         69
  Raw sum of deviations 10.11022 (about 8.5377798)
  Min sum of deviations  6.66484                    Pseudo R2     =     0.3408

------------------------------------------------------------------------------
             |               Robust
    ln_price |      Coef.   Std. Err.      t    P&gt;|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iforeign_1 |   .5487176   .0932672     5.88   0.000     .3622185    .7352168
   _Irep78_1 |   .0645521   .1333406     0.48   0.630    -.2020789    .3311831
   _Irep78_3 |  -.0155096   .1133294    -0.14   0.892    -.2421257    .2111065
   _Irep78_4 |   .0489684   .1192354     0.41   0.683    -.1894575    .2873943
   _Irep78_5 |   .0751907   .1523226     0.49   0.623    -.2293972    .3797786
         mpg |   .0015589   .0116453     0.13   0.894    -.0217272    .0248451
      weight |   .0004839   .0000915     5.29   0.000      .000301    .0006669
       _cons |   6.918565   .5021886    13.78   0.000     5.914376    7.922753
------------------------------------------------------------------------------

. qreg $ylist $xlist2 , quantile(.6106) vce(robust) baselevels
Iteration  1:  WLS sum of weighted deviations =  6.8154121

Iteration  1: sum of abs. weighted deviations =  6.7905909
Iteration  2: sum of abs. weighted deviations =   6.786993

.6106 Quantile regression                           Number of obs =         69
  Raw sum of deviations 10.43622 (about 8.6490984)
  Min sum of deviations 6.786993                    Pseudo R2     =     0.3497

------------------------------------------------------------------------------
             |               Robust
    ln_price |      Coef.   Std. Err.      t    P&gt;|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 _Iforeign_1 |   .5881271   .1810923     3.25   0.002     .2260107    .9502435
   _Irep78_1 |   .0713214    .130316     0.55   0.586    -.1892616    .3319044
   _Irep78_3 |   .0627545   .0835455     0.75   0.455    -.1043051    .2298142
   _Irep78_4 |   .0570218   .1340484     0.43   0.672    -.2110245    .3250682
   _Irep78_5 |   .0460545   .1890994     0.24   0.808    -.3320732    .4241822
         mpg |   .0016507   .0162437     0.10   0.919    -.0308306    .0341319
      weight |   .0004913   .0001362     3.61   0.001     .0002189    .0007636
       _cons |   6.889561   .7409569     9.30   0.000     5.407926    8.371196
------------------------------------------------------------------------------

.  
. quietly qreg $ylist $xlist2

. 
. grqreg, cons ci ols olsci
